import events
import cypher

# выбрать путь, по которому хранятся все мероприятия
# просканировать путь
# обновить список мероприятий
# взаимодействия с мероприятиями
# 1) добавить мерприятие
# 2) прочитать мероприятие
# 3) удалить мероприятие
# 4) редактировать мероприятие

events.set_path("C:/Users/toto_/OneDrive/Рабочий стол/test/")

print(cypher.encrypt_number("B2F307C283D0AB70C70B61376", cypher.get_gamma_filename("000000")))

# simple
# 1597538524561234816326412
# B2F307C283D0AB70C70B61376

# hard
# 1597538524561234816326412
# 73FFDF1262935973E6DAC89EB

# D49B8B55C515E037A0B28FE8F
